import React from 'react';
import { Carousel, Table } from 'react-bootstrap';

const Aikido = () => {
    return (
        <div>
            <h1 className='text-center mt-5'>Айкидо</h1>
            <Carousel className=' text-center' >
                <Carousel.Item>
                    <img
                        width={"100%"} height={"850px"}
                        className="d-block  p-5 "
                        src="https://upload.wikimedia.org/wikipedia/commons/4/41/G_Blaize_Kokiu_Nague_2.JPG"
                        alt="First slide"
                    /> </Carousel.Item>
                <Carousel.Item>
                    <iframe className="d-block  p-5 " width={"100%"} height={"850px"} src="https://www.youtube.com/embed/GZt1MkQok7U" title="Айкидо vs ММА: РЕАЛЬНЫЙ БОЙ" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                </Carousel.Item>
                <Carousel.Item>
                    <img
                        width={"100%"} height={"850px"}
                        className="d-block  p-5 "
                        src="https://avteamclub.ru/wp-content/uploads/2021/08/photo_2021-08-13_17-25-28-e1628870720240.jpg"
                        alt="Third slide"
                    />
                </Carousel.Item>
            </Carousel>
            <div className='d-flex container' >
                <div className='d-block w-25 m-3 p-3' style={{ backgroundColor: "rgb(235 239 246)", borderRadius: "30px" }}>
                    <p>Айкидо (япончо - күчтү топтоо жолу) - Чыгыштын өзүн-өзү коргоо боюнча жекеме-жеке күрөшүү чеберчилигинин япониялык түрү. Айкидону япониялык мастер Морихей Уесиба самурайлардын аскер искусствосунун негизинде спорттун бир түрү катары иштеп чыккан (1920-30-ж). Айкидо жоокердик кесиптин чеберчилиги катары өзүнө кэндо, бодзюцу, джиу-джицу сыяктуу бир нече стилдерди камтыйт. Мында каршылашынын аракетин өзүнө бурдуруу максатында чабуулдап жана кайра кармоодон тез кетүү пайдаланылат. Анун ыкмаларынын жети жүз жылдык тарыхы бар, түпкү тамыры самурай доорунан башталат.</p>
                </div>
                <div className='d-block w-25 m-3 p-3' style={{ backgroundColor: "rgb(235 239 246)", borderRadius: "30px" }}>
                    <p>Айкидо ыкмалары ар тараптан келишкен, адамдын денесин жана анын руханий жактан өсүшүн көздөйт. Айкидо бул табият менен адамдын тыгыз байланышын көрсөтүүчү система деп айтылат. Мында адам өзүнүн психикасынын тереңиндеги касиеттерин даана көрсөтө ала турган таймашуунун жагдайлары топтолгон. Кыргызстандын айкидо федерациясы 1995-ж. Бишкекте түзүлүп, 1996-жылдан Айкидонун Бүткүл дүйнөлүк борбору - Айкикай Хомбу Додзе (Токио, Япония) тарабынан таанылган. Кыргызстанда бүгүнкү күндө айкидо башка чыгыш таймашууларынын катарында өнүгүүдө.</p>
                </div>
                <div className='d-block w-25 m-3 p-3' style={{ backgroundColor: "rgb(235 239 246)", borderRadius: "30px" }}>
                    <p>Айкидо Дайто-рю Айкиджуцуда пайда болгон, бирок 1920-жылдардын аягында Оомотонун окууларынын Уэшибага тийгизген таасиринен улам андан алыстай баштаган. Анын алгачкы окуучуларынын жазууларында айки-джутсу деген термин дайыма колдонулат.

                        Уэсибанын улуу окуучулары айкидо менен машыгууга ар кандай мамиле жасашат, бул алардын андан үйрөнгөн убактысына жараша. Бүгүнкү күндө айкидо бүткүл дүйнө жүзү боюнча бир нече стилдер түрүндө кездешет. Бирок, алардын бардыгын көбүрөөк формулировкаланган принциптер бириктирет </p>
                </div>
                <div className='d-block w-25 m-3 p-3' style={{ backgroundColor: "rgb(235 239 246)", borderRadius: "30px" }}>
                    <p>Айкидо Дайто-рю Айкиджуцуда пайда болгон, бирок 1920-жылдардын аягында Оомотонун окууларынын Уэшибага тийгизген таасиринен улам андан алыстай баштаган. Анын алгачкы окуучуларынын жазууларында айки-джутсу деген термин дайыма колдонулат.

                        Уэсибанын улуу окуучулары айкидо менен машыгууга ар кандай мамиле жасашат, бул алардын андан үйрөнгөн убактысына жараша. Бүгүнкү күндө айкидо бүткүл дүйнө жүзү боюнча бир нече стилдер түрүндө кездешет. Бирок, алардын бардыгын көбүрөөк формулировкаланган принциптер бириктирет</p>
                </div>
            </div>
            <div className='container d-flex'>
                <div className='d-block'>
                    <iframe width="740" height="500" src="https://www.youtube.com/embed/d-wyC7rnBeg" title="Айкидо и дети" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                </div>
                <div className='d-block m-2 p-3' style={{ backgroundColor: "rgb(235 239 246)", borderRadius: "30px" }}>
                    Айкидо - О-Сэнсей Морихей Уэсиба тарабынан негизделген жапон согуш өнөрү. Айкидонун атынан О-Сенсей бул согуш өнөрүнүн маңызын – гармония жолун берген. Ал акыл-эстин, дененин жана рухтун гармониялуу биригүүсү жана өнүгүүсү зарылчылыгы жөнүндө айтты. Айкидо – бул практикалык билимдердин бүтүндөй системасы, ал куралсыз ыкмаларды жана машыгуучуларга зыян келтирбөө үчүн жыгач куралдардын ар кандай түрлөрүн колдонууну камтыйт.
                    Мындай курал-жарактар: танто, бокен, жо, бо ж.б.
                    Алынган көндүмдөр жана көптөгөн тренингдер эффективдүү натыйжа берет жана бере алат. Биринчиден, бул машыккан дене, туруктуу психика, чың ден соолук, өзүн жогору баалоо, лидерлик сапаттар. Айкидо заманбап адамдын өнүгүүсү үчүн зарыл болгон нерселердин бардыгын топтойт. Бирок эң негизгиси Айкидо сырткы дүйнө жана өзүң менен гармонияда жашоого үйрөтөт.
                </div>

            </div>
            <div className='container'>
                <h1 className='text-center mt-4'>Иштоо убактысы</h1>
                <Table striped bordered hover>
                    <thead>
                        <tr>
                            <th>жылы</th>
                            <th>2005-2009</th>
                            <th>2009-2013</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td>куну</td>
                            <td>шар бей иш</td>
                            <td>шар бей иш</td>
                        </tr>
                        <tr>
                            <td>толом</td>
                            <td>1000cом</td>
                            <td>1000сом</td>
                        </tr>
                        <tr>
                            <td>убакыт</td>
                            <td>15:30-16:30</td>
                            <td>9:30-10:30</td>
                        </tr>

                    </tbody>
                </Table>
            </div>


        </div>
    );
};

export default Aikido;