import React from 'react';
import {Table} from "react-bootstrap"

function Barba(props) {
    return (
        <div className='container'>
            <h1 className='text-center m-4'>Эркин курош</h1>
            <img width={"100%"} style={{borderRadius: "30px"}} src='https://upload.wikimedia.org/wikipedia/commons/8/82/2016_Summer_Olympics%2C_Men%27s_Freestyle_Wrestling_57_kg_21.jpg'/>
            <div className="container " style={{backgroundColor:"rgb(235 239 246)",borderRadius: "30px"}}>
            <h2 className='text-center mt-5'>Эркин күрөштүн тарыхы</h2>

                <h5 className='p-2'>Ланкашир (Англия) эркин күрөштүн мекени болуп эсептелет. Ал грек-рим күрөшүнөн бир аз кечирээк пайда болгон жана андан катаал ыкмалар менен айырмаланган, атап айтканда, муундарга каршы кармашуу, муундарды бурмалоо жана башка оорутуу ыкмаларына жол берилген. Кийин Америкага эркин күрөш алынып келинип, ал эки багытта өнүгө баштаган: күрөш жана эркин күрөш. Спорттук эркин күрөш АКШнын колледждеринде жана университеттеринде өстүрүлгөн (Орусияда ал «эркин америкалык ышкыбоз күрөшү» деп аталган).Эл аралык эркин күрөштүн эрежелери күрөштүн бул түрүнө окшош. 1904-жылы эркин күрөш олимпиадалык спорт түрү катары таанылып, Сент-Луис шаарында (АКШ) Олимпиада оюндарынын программасына киргизилген. Бардык 42 катышуучу АКШдан болгон, бул АКШдан башка эч ким бул дисциплинаны жакшы билбегендиктен болду. Улуттук чемпионат Олимпиадага туш келди жана АКШ аны олимпиадалык мелдеш катары уюштурган. Жалпысынан, 1904-жылдан 1996-жылга чейин америкалыктар Олимпиада оюндарында 99 Олимпиада медалын жеңип алышкан – бул ошол кездеги башка өлкөлөрдөн көп. 1906-жылы кийинки Олимпиада оюндарында гректер грек-рим күрөшүнө артыкчылык беришип, эркин күрөштү программадан алып салышкан.анткени ал аларга белгисиз болчу. 1904-жылдан 1912-жылга чейинки мезгилде бир өлкөдөн бир салмак категориясына кирген спортчулардын саны чектелген эмес. 1920-жылдан 1924-жылга чейин бир салмак категориясына бир өлкөдөн экиден ашык спортчу кирүүгө уруксат берилген эмес. 1921-жылы Эл аралык ышкыбоз күрөш федерациясы (IAWF) түзүлгөн. 1928-жылы Парижде биринчи Европа чемпионаты өткөн. Ал эми ошол эле жылы салмак категориясында бир гана катышуучу өлкө намысын коргой алат деген чечим кабыл алынган. 1951-жылы Бириккен күрөш стилдеринин эл аралык федерациясы түзүлгөн.
                (FILA, Француз ФИЛА). Ал дүйнөлүк чемпионаттарды өткөрө баштайт. Эркин күрөштүн заманбап эрежелери Эркин күрөш боюнча беттеш 30 секундалык тыныгуу менен ар бири 3 мүнөттөн 2 таймга созулат. </h5>
            </div>
            <div className='container'>
                <h1 className='text-center mt-5'>Иштоо убактысы</h1>
                <Table striped bordered hover>
                   
                    <tbody>
                        <tr>
                            <td>куну</td>
                            <td>дуй шей жума</td>
                            <td>шар бей иш</td>
                        </tr>
                        <tr>
                            <td>толом</td>
                            <td>1000cом</td>
                            <td>1000сом</td>
                        </tr>
                        <tr>
                            <td>убакыт</td>
                            <td>9:30-10:30</td>
                            <td>15:00-16:30</td>
                        </tr>

                    </tbody>
                </Table>
            </div>
            
        </div>
    );
}

export default Barba;